const aboutUsSectionData =
  'הישיבה תנחיל לצִבור התלמידים ולבאים בשעריה את הצורך החיוני לעסוק בעבודת המידות, בבניית השקפת עולם אמונית וביצירת קשר קבוע ועוצמתי לתורה ולמצוותיה. כל אלו ייעשו בישיבה, עם בניית רצון, אחריות וכלים לחיים בדרך זו, לאורך ימים ושנים טובות.\nמהישיבה תופיע תורה גדולה הקשובה לדור ויונקת מאוירא דארץ ישראל ומנשמת התורה.\nדרכה של הישיבה תצמיח "תלמידי חכמים שבארץ ישראל, המנעימים זה לזה".\nהישיבה תהיה שותפה באחריות לכלל האומה, ותיטע אותה בלב תלמידיה. אחריות זו כוללת נשיאה בעול עם הציבור, בכל אורחות החיים, בלימוד תורה ובשירות הצבאי, וחשיפת ערכי אהבת האומה, ארצה ותורתה, השוכנים בלב הציבור.';

export default aboutUsSectionData;
